Revit 2027 API
SlabShapeEditor.AddPoints Method
 Add an array of points to the element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<SlabShapeVertex> AddPoints(
	IList<XYZ> points
)
Public Function AddPoints (
	points As IList(Of XYZ)
) As IList(Of SlabShapeVertex)
public:
IList<SlabShapeVertex^>^ AddPoints(
	IList<XYZ^>^ points
)
member AddPoints :
        points : IList<XYZ> -> IList<SlabShapeVertex>
Parameters
points IList<XYZ>
 The point array.
Return Value
IList<SlabShapeVertex>
 The newly added slab shape vertices.
Exceptions
Exception | Condition
ArgumentException |  The input points are not valid. Please check if they are distinct on the x-y plane.
ArgumentNullException |  A non-optional argument was null
Remarks
 The newly added points should be distinct on the x-y plane, and they should be inside the element boundary. SlabShapeEditor must be enabled before calling this method. Regenerate the document after element creation if this method is called in the same transaction.
See Also
Reference
SlabShapeEditor Class
Autodesk.Revit.DB Namespace